brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "tree"
brew "jq"
brew "git"
brew "gh"
brew "git-delta"
brew "lazygit"
brew "btop"
brew "htop"
brew "ncdu"
brew "duf"
brew "procs"
brew "dust"
brew "starship"
brew "tmux"
brew "zellij"
brew "stow"
brew "helix"
brew "glow"
brew "tldr"
brew "trash-cli"
brew "ouch"
brew "yazi"
brew "mise"
brew "ffmpeg"
brew "mas"
brew "dockutil"
brew "lazydocker"
brew "kubernetes-cli"
brew "awscli"

# gnu tools, so the shared shell config matches linux
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "procps"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "tailscale-app"

cask "ghostty"
cask "visual-studio-code"
cask "claude-code"
cask "docker-desktop"
cask "tableplus"

cask "brave-browser"
cask "zen"

cask "raycast"
cask "jordanbaird-ice"
cask "monitorcontrol"
cask "clocker"
cask "caffeine"
cask "localsend"
cask "slack"
cask "zoom"
cask "loom"
cask "whatsapp"
cask "spotify"
cask "dropbox"
cask "calibre"
cask "adobe-digital-editions"
cask "logi-options+"
cask "logitune"

cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
